#+TITLE: BDD Prelude
#+AUTHOR: Rick Neff
#+EMAIL: NeffR@byui.edu
#+DATE: 25 March 2019
#+OPTIONS: H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t ':t |:t
#+OPTIONS: html-postamble:t
#+STARTUP: showeverything entitiespretty inlineimages
#+SETUPFILE: theme-bigblow.setup

** How About
     the Distributive properties?

    (P \land (Q \lor R)) \leftrightarrow ((P \land Q) \lor (P \land R))

| ( | P | ∧ | ( | Q | ∨ | R | ) | ) | ↔ | ( | ( | P | ∧ | Q | ) | ∨ | ( | P | ∧ | R | ) | ) |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
|   | 0 | 0 |   | 0 | 0 | 0 |   |   | 1 |   |   | 0 | 0 | 0 |   | 0 |   | 0 | 0 | 0 |   |   |
|   | 0 | 0 |   | 0 | 1 | 1 |   |   | 1 |   |   | 0 | 0 | 0 |   | 0 |   | 0 | 0 | 1 |   |   |
|   | 0 | 0 |   | 1 | 1 | 0 |   |   | 1 |   |   | 0 | 0 | 1 |   | 0 |   | 0 | 0 | 0 |   |   |
|   | 0 | 0 |   | 1 | 1 | 1 |   |   | 1 |   |   | 0 | 0 | 1 |   | 0 |   | 0 | 0 | 1 |   |   |
|   | 1 | 0 |   | 0 | 0 | 0 |   |   | 1 |   |   | 1 | 0 | 0 |   | 0 |   | 1 | 0 | 0 |   |   |
|   | 1 | 1 |   | 0 | 1 | 1 |   |   | 1 |   |   | 1 | 0 | 0 |   | 0 |   | 1 | 1 | 1 |   |   |
|   | 1 | 1 |   | 1 | 1 | 0 |   |   | 1 |   |   | 1 | 1 | 1 |   | 1 |   | 1 | 0 | 0 |   |   |
|   | 1 | 1 |   | 1 | 1 | 1 |   |   | 1 |   |   | 1 | 1 | 1 |   | 1 |   | 1 | 1 | 1 |   |   |

    (P \lor (Q \land R)) \leftrightarrow ((P \lor Q) \land (P \lor R))

| ( | P | ∨ | ( | Q | ∧ | R | ) | ) | ↔ | ( | ( | P | ∨ | Q | ) | ∧ | ( | P | ∨ | R | ) | ) |
|---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---+---|
|   | 0 | 0 |   | 0 | 0 | 0 |   |   | 1 |   |   | 0 | 0 | 0 |   | 0 |   | 0 | 0 | 0 |   |   |
|   | 0 | 0 |   | 0 | 0 | 1 |   |   | 1 |   |   | 0 | 0 | 0 |   | 0 |   | 0 | 1 | 1 |   |   |
|   | 0 | 0 |   | 1 | 0 | 0 |   |   | 1 |   |   | 0 | 1 | 1 |   | 1 |   | 0 | 0 | 0 |   |   |
|   | 0 | 1 |   | 1 | 1 | 1 |   |   | 1 |   |   | 0 | 1 | 1 |   | 1 |   | 0 | 1 | 1 |   |   |
|   | 1 | 1 |   | 0 | 0 | 0 |   |   | 1 |   |   | 1 | 1 | 0 |   | 1 |   | 1 | 1 | 0 |   |   |
|   | 1 | 1 |   | 0 | 0 | 1 |   |   | 1 |   |   | 1 | 1 | 0 |   | 1 |   | 1 | 1 | 1 |   |   |
|   | 1 | 1 |   | 1 | 0 | 0 |   |   | 1 |   |   | 1 | 1 | 1 |   | 1 |   | 1 | 1 | 0 |   |   |
|   | 1 | 1 |   | 1 | 1 | 1 |   |   | 1 |   |   | 1 | 1 | 1 |   | 1 |   | 1 | 1 | 1 |   |   |

#+BEGIN_SRC elisp :results silent
  (defun truth-table-for (list-of-variables)
    (let ((list-of-named-variables (mapcar 'symbol-name list-of-variables)))
      (append (list (append list-of-named-variables
                    (list (format "f(%s)"
                                  (string-join list-of-named-variables ", ")))) 'hline)
              (loop with n = (length list-of-variables)
                    for i from 0 below (expt 2 n)
                    collect (pad (to-binary i) n)))))
#+END_SRC

#+BEGIN_SRC elisp :results value
  (truth-table-for '(P Q R))
#+END_SRC

#+RESULTS:
| P | Q | R | f(P, Q, R) | DNF             | \not CNF | CNF     |
|---+---+---+------------+-----------------+-------+---------|
| 0 | 0 | 0 |          0 |                 |     1 | ( ? ) \land |
| 0 | 0 | 1 |          1 | (\not{}P \land \not{}Q \land R) \lor |     0 |         |
| 0 | 1 | 0 |          0 |                 |     1 | ( ? ) \land |
| 0 | 1 | 1 |          0 |                 |     1 | ( ? ) \land |
| 1 | 0 | 0 |          0 |                 |     1 | ( ? ) \land |
| 1 | 0 | 1 |          1 | (P \land \not{}Q \land R) \lor  |     0 |         |
| 1 | 1 | 0 |          1 | (P \land Q \land \not{}R)    |     0 |         |
| 1 | 1 | 1 |          0 |                 |     1 | ( ? )   |

